Revit 2024 API
ParameterTypeId.FabricationProductDataLongDescription Property
 "Product Long Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationProductDataLongDescription { get; }
Visual Basic
Public Shared ReadOnly Property FabricationProductDataLongDescription As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationProductDataLongDescription {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace